fonecmid-diplom/src/Documents/ВКМ_ОкладыИПремииСотрудников/ВКМ_ОкладыИПремииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОкладыИПремииСотрудников</name>
  <registerRecords>InformationRegister.ВКМ_УсловияОплатыСотрудников</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановитьПроцентОтРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОкладыИПремииСотрудников/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция СотрудникПриИзмененииНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДоступа.Профиль.Наименование КАК ПрофильНаименование
	|ИЗ
	|	Справочник.ГруппыДоступа КАК ГруппыДоступа
	|ГДЕ
	|	ГруппыДоступа.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Объект.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивГрупп = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивГрупп.Добавить(ВыборкаДетальныеЗаписи.ПрофильНаименование);
	КонецЦикла;
	Возврат МассивГрупп.Найти("Специалист");
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ПроверкаСотрудника();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСотрудника()
	
	Профиль = СотрудникПриИзмененииНаСервере(); 
	Если Профиль <> Неопределено Тогда
		Элементы.УстановитьПроцентОтРабот.Видимость = Истина;
	Иначе
		Элементы.УстановитьПроцентОтРабот.Видимость = ЛожЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверкаСотрудника();
	Если Объект.УстановитьПроцентОтРабот Тогда
		 Элементы.ПроцентПремии.Видимость = Истина;
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПроцентОтРаботПриИзменении(Элемент)
	Элементы.ПроцентПремии.Видимость = Истина;
КонецПроцедуры
